<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/341b9b84-bdfa-4f00-bb5c-05eb2386542a/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-notify/staging-notify-service"
        name                               = "staging-notify-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-notify:37" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-notify:37" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-notify" -> (known after apply)
      ~ revision                 = 37 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place
  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {
        id                           = "staging-notify-keystore-docdb-primary-instance-0"
      ~ instance_class               = "db.t4g.medium" -> "db.r5.large"
        tags                         = {}
        # (20 unchanged attributes hidden)
    }

  # module.o11y.grafana_dashboard.dashboard will be updated in-place
  ~ resource "grafana_dashboard" "dashboard" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels        = [
                    {
                        collapsed  = false
                        datasource = {
                            type = "datasource"
                            uid  = "grafana"
                        }
                        gridPos    = {
                            h = 1
                            w = 24
                            x = 0
                            y = 0
                        }
                        targets    = [
                            {
                                datasource = {
                                    type = "datasource"
                                    uid  = "grafana"
                                }
                            },
                        ]
                        title      = "Application"
                        type       = "row"
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ expr         = "sum(increase(subscribed_project_topics[$__rate_interval]))" -> "subscribed_project_topics"
                              ~ legendFormat = "Subscribed Project Topics" -> "r{{aws_ecs_task_revision}}"
                              ~ refId        = "Subscribed Project Topics" -> "SubscribedProjectTopics"
                                # (2 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ expr         = "sum(increase(subscribed_client_topics[$__rate_interval]))" -> "subscribed_client_topics"
                              ~ legendFormat = "Subscribed Client Topics" -> "r{{aws_ecs_task_revision}}"
                              ~ refId        = "Subscribed Client Topics" -> "SubscribedClientTopics"
                                # (2 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ refId        = "Sent" -> "NotificationsSent"
                                # (4 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ refId        = "Failed" -> "NotificationsFailed"
                                # (4 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ refId        = "AccountsNotFound" -> "NotificationsNotFound"
                                # (4 unchanged attributes hidden)
                            },
                        ]
                        # (9 unchanged attributes hidden)
                    },
                    {
                        collapsed  = false
                        datasource = {
                            type = "datasource"
                            uid  = "grafana"
                        }
                        gridPos    = {
                            h = 1
                            w = 24
                            x = 0
                            y = 25
                        }
                        targets    = [
                            {
                                datasource = {
                                    type = "datasource"
                                    uid  = "grafana"
                                }
                            },
                        ]
                        title      = "ECS"
                        type       = "row"
                    },
                    # (17 unchanged elements hidden)
                ]
                tags          = []
                # (19 unchanged attributes hidden)
            }
        )
        id           = "0:staging-notify"
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-notify/staging-notify-service"%0A        name                               = "staging-notify-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-notify:37" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-notify:37" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-notify" -> (known after apply)%0A      ~ revision                 = 37 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place%0A  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {%0A        id                           = "staging-notify-keystore-docdb-primary-instance-0"%0A      ~ instance_class               = "db.t4g.medium" -> "db.r5.large"%0A        tags                         = {}%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.o11y.grafana_dashboard.dashboard will be updated in-place%0A  ~ resource "grafana_dashboard" "dashboard" {%0A      ~ config_json  = jsonencode(%0A          ~ {%0A              ~ panels        = [%0A                    {%0A                        collapsed  = false%0A                        datasource = {%0A                            type = "datasource"%0A                            uid  = "grafana"%0A                        }%0A                        gridPos    = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 0%0A                        }%0A                        targets    = [%0A                            {%0A                                datasource = {%0A                                    type = "datasource"%0A                                    uid  = "grafana"%0A                                }%0A                            },%0A                        ]%0A                        title      = "Application"%0A                        type       = "row"%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ expr         = "sum(increase(subscribed_project_topics[$__rate_interval]))" -> "subscribed_project_topics"%0A                              ~ legendFormat = "Subscribed Project Topics" -> "r{{aws_ecs_task_revision}}"%0A                              ~ refId        = "Subscribed Project Topics" -> "SubscribedProjectTopics"%0A                                # (2 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ expr         = "sum(increase(subscribed_client_topics[$__rate_interval]))" -> "subscribed_client_topics"%0A                              ~ legendFormat = "Subscribed Client Topics" -> "r{{aws_ecs_task_revision}}"%0A                              ~ refId        = "Subscribed Client Topics" -> "SubscribedClientTopics"%0A                                # (2 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ refId        = "Sent" -> "NotificationsSent"%0A                                # (4 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ refId        = "Failed" -> "NotificationsFailed"%0A                                # (4 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ refId        = "AccountsNotFound" -> "NotificationsNotFound"%0A                                # (4 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (9 unchanged attributes hidden)%0A                    },%0A                    {%0A                        collapsed  = false%0A                        datasource = {%0A                            type = "datasource"%0A                            uid  = "grafana"%0A                        }%0A                        gridPos    = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 25%0A                        }%0A                        targets    = [%0A                            {%0A                                datasource = {%0A                                    type = "datasource"%0A                                    uid  = "grafana"%0A                                }%0A                            },%0A                        ]%0A                        title      = "ECS"%0A                        type       = "row"%0A                    },%0A                    # (17 unchanged elements hidden)%0A                ]%0A                tags          = []%0A                # (19 unchanged attributes hidden)%0A            }%0A        )%0A        id           = "0:staging-notify"%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 3 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*